<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'required' => 'حقل :attribute مطلوب.',
    'email' => 'حقل :attribute يجب أن يكون بريدًا إلكترونيًا صالحًا.',
    'unique' => 'حقل :attribute موجود مسبقًا.',
    'numeric' => 'حقل :attribute يجب أن يكون رقمًا.',
    'exists' => 'القيمة المحددة في :attribute غير موجودة.',
    'in' => 'القيمة المختارة في :attribute غير صحيحة.',
    'array' => 'حقل :attribute يجب أن يكون مصفوفة.',
    'image' => 'الملف في :attribute يجب أن يكون صورة.',
    'file' => 'حقل :attribute يجب أن يكون ملفًا.',
    'max' => [
        'file' => 'حجم الملف في :attribute يجب ألا يتجاوز :max كيلوبايت.',
        'string' => 'حقل :attribute يجب ألا يتجاوز :max حرفًا.',
        'array' => 'حقل :attribute يجب ألا يحتوي على أكثر من :max عناصر.',
    ],
    'min' => [
        'string' => 'حقل :attribute يجب أن يكون على الأقل :min حرفًا.',
        'numeric' => 'حقل :attribute يجب أن يكون على الأقل :min.',
        'array' => 'حقل :attribute يجب أن يحتوي على الأقل على :min عناصر.',
    ],
    'confirmed' => 'حقل :attribute التأكيد غير متطابق.',

    /*
    |--------------------------------------------------------------------------
    | Custom Attribute Names
    |--------------------------------------------------------------------------
    */
    'attributes' => [
        'user_type' => 'نوع المستخدم',
        'category_id' => 'التصنيف',
        'price' => 'السعر',
        'images' => 'الصور',
        'days_availability' => 'أيام التوفر',
        'ar_title' => 'العنوان بالعربية',
        'en_title' => 'العنوان بالإنجليزية',
        'ar_description' => 'الوصف بالعربية',
        'en_description' => 'الوصف بالإنجليزية',
        'is_active' => 'حالة التفعيل',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'device_token' => 'رمز الجهاز',
        'name' => 'الاسم',
        'sex' => 'الجنس',
        'material_status' => 'الحالة الاجتماعية',
    ],

];
